app/controllers/events_controller.rb

SELECT "events".* FROM "events"
---
  def index
    render :json => Event.all

INSERT INTO "events" ("title", "color", "start", "end", "created_at", "updated_at") VALUES ('here we are', 'blue', '2012-07-01 07:00:00.000000', '2012-07-01 07:00:00.000000', '2012-07-13 14:39:21.106237', '2012-07-13 14:39:21.106237')
---
  def create
      render :json =>
          Event.create!(:start => params[:start], :end => params[:end], :title => params[:title],
          :color => params[:color])

SELECT "events".* FROM "events" WHERE "events"."id" = 980190963 LIMIT 1
UPDATE "events" SET "start" = '2012-07-02 07:00:00.000000', "end" = NULL, "updated_at" = '2012-07-13 14:42:30.104579' WHERE "events"."id" = 980190963
---
  def update
    event = Event.find(params[:id])
    event.update_attributes!(:start => params[:start], :end => params[:end], :title => params[:title],
      :color => params[:color])